{
  "nav": {
    "home": "Inicio",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "buttons": {
    "login": "Iniciar sesión",
    "register": "Registrarse"
  },
  "texts": {
    "welcome": "Bienvenido a mi sitio web",
    "description": "Soy desarrolladora web y me apasiona crear experiencias digitales."
  },

  "home": {
    "title": "Estudiante de Ingeniería de Sistemas",
    "slogan": "Capaz de construir, probar y dirigir con visión y compromiso.",
    "aboutBtn": "Sobre mí",
    "cvBtn": "Mi CV",
    "contactTitle": "¿Te interesa mi perfil profesional?",
    "contactText": "Disponible para colaborar en desarrollo, diseño o gestión de proyectos.",
    "contactBtn": "¡Contáctame Ahora!"
  },

  "myProjects": {
    "title": "Mis Proyectos",
    "projects": [
      {
        "key": "sauce_demo",
        "title": "QA Engineer – Sauce Demo",
        "description": "Proyecto de pruebas QA manual centrado en validar funcionalidades principales de e-commerce.",
        "details": "Diseño y ejecución de casos de prueba, reporte de errores y problemas de UX, y documentación del proceso de QA utilizando prácticas estándar de la industria.",
        "button": "Ver Proyecto"
      },
      {
        "key": "hems",
        "title": "HEMS - Home Energy Management System",
        "description": "Sistema de Gestión de Energía en Hogares (HEMS).",
        "details": "Sistema basado en tecnologías IoT para monitorear, analizar y optimizar el consumo energético en hogares de Santa Marta. Proyecto grupal que integra dispositivos inteligentes para proporcionar análisis en tiempo real del uso de energía, permitiendo a los usuarios tomar decisiones informadas para reducir costos y mejorar la eficiencia energética.",
        "button": "Ver Proyecto"
      },
      {
        "key": "pm_project",
        "title": "Gestión de Proyecto Educativo - AdaptEdu",
        "description": "Liderazgo en planificación y gestión de software educativo con IA.",
        "details": "Lideré la planificación y gestión de un proyecto de software educativo enfocado en reducir la brecha de acceso y calidad en la educación personalizada. El proyecto consistió en el desarrollo de una plataforma web que utiliza inteligencia artificial para adaptar contenidos y actividades según el estilo de aprendizaje de cada estudiante.",
        "button": "Ver Proyecto"
      },
      {
        "key": "flower",
        "title": "Sitio Web de Flores",
        "description": "Sitio web estático diseñado con HTML y CSS.",
        "details": "Este proyecto es fundamental en mi carrera, pues representa uno de mis primeros pasos en el mundo del desarrollo web. Fue construido desde cero utilizando HTML5 y CSS3 puros, siguiendo el excelente tutorial de 'Online Tutorials' en YouTube. Es un testimonio de mi dedicación por aprender y mi atención al detalle visual desde mis inicios.",
        "button": "Ver Proyecto"
      }
    ]
  },

  "about": {
    "title": "Sobre mí",
    "greeting": "¡Hola! soy",
    "paragraph1": "Estudiante de Ingeniería de Sistemas. Con enfoque en desarrollo web full stack, Gestión de proyectos y Software Testing. Me apasiona el frontend, creando interfaces dinámicas con React, JavaScript, Next.js, HTML5, CSS3, SASS, Tailwind CSS y herramientas de diseño como Figma.",
    "paragraph2": "Cuento con conocimientos en MySQL, PostgreSQL, control de versiones con Git/GitHub, y metodologías ágiles como Scrum, donde he aprendido a trabajar de forma colaborativa, gestionar tareas en sprints y adaptarme a cambios de manera eficiente. Actualmente me formo en QA y pruebas manuales, con el objetivo de contribuir a productos estables y centrados en el usuario.",
    "interestsTitle": "Mis intereses",
    "interests": [
      "Desarrollo web frontend y backend",
      "Diseño de interfaces interactivas (UI/UX)",
      "Software Testing y QA",
      "Gestión de proyectos con metodologías ágiles (Scrum)"
    ],
    "skillsTitle": "Mis principales Skills"
  },

  "footer": {
    "verse": "Levántate y Resplandece - Isaías 60:1",
    "thanks": "Gracias por visitar mi portafolio web."
  },

  "techSlider": {
    "title": "Mi Stack tecnológico"
  },

  "projectDetail": {
    "notFound": "Proyecto no encontrado",
    "githubLink": "Ver código en GitHub",
    "viewDocument": "Ver Documento",
    "tutorialLink": "Ver Tutorial",
    "technologiesTitle": "Tecnologías Utilizadas:"
  },

  "contact": {
    "title": "Contacto",
    "subtitle": "¿Tienes un proyecto en mente? ¡Hablemos!",
    "alternativeMessage": "O también me puedes escribir directamente desde aquí:",
    "form": {
      "name": "Nombre",
      "email": "Email",
      "subject": "Asunto",
      "message": "Mensaje",
      "send": "Enviar Mensaje",
      "sending": "Enviando...",
      "success": "¡Mensaje enviado exitosamente!",
      "error": "Error al enviar el mensaje. Intenta nuevamente."
    },
    "info": {
      "title": "Información de Contacto",
      "email": "Email",
      "location": "Ubicación",
      "social": "Redes Sociales"
    },
    "validation": {
      "nameRequired": "El nombre es requerido",
      "emailRequired": "El email es requerido",
      "emailInvalid": "Email inválido",
      "subjectRequired": "El asunto es requerido",
      "messageRequired": "El mensaje es requerido"
    }
  }
}
